emacs/configs/13-platform-windows.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows-Specific Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Windows-Specific Configuration</h1>
<p>
Settings that only apply on Windows systems.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">windows-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font set for Windows."</span>
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka NFM"</span> <span class="org-builtin">:height</span> 120 <span class="org-builtin">:weight</span> 'light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"Noto Sans KR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
      (add-hook 'server-after-make-frame-hook #'m180/font-set)
  (m180/font-set))

(<span class="org-keyword">setq</span> explicit-shell-file-name (executable-find <span class="org-string">"pwsh"</span>))
(<span class="org-keyword">setq</span> shell-file-name (expand-file-name <span class="org-string">"cmdproxy.exe"</span> exec-directory))
(<span class="org-keyword">setq</span> org-babel-shell-command shell-file-name)
(<span class="org-keyword">setq</span> org-babel-C-complier <span class="org-string">"gcc"</span>
        org-babel-C++-complier <span class="org-string">"g++"</span>)
(<span class="org-keyword">setq</span> grep-use-null-device nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">(defun pwsh-shell-mode-setup ()
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">"Powershell setup for Windows."
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local comint-prompt-read-only t)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local comint-process-echoes t))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'shell-mode-hook #'pwsh-shell-mode-setup)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq eshell-windows-shell-file (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq explicit-shell-file-name (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq shell-file-name (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setenv "SHELL" shell-file-name)
</span>
(<span class="org-keyword">provide</span> '<span class="org-constant">windows-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">windows-conf.el ends here</span>
</pre>
</div>
</main>
</body>
</html>
